content/posts/oh_study_2017.md
+++
title = "oh_study_2017 | Study on Robot Trajectory Planning by Robot End-Effector Using Dual Curvature Theory of the Ruled Surface"
author = ["João Gutemberg Farias"]
draft = false
+++

tags
: [Dual Quaternions Applications]({{< relref "dual_quaternions_applications" >}})

The work describes the trajectory of the robot's end effector by using [Differential Geometry]({{< relref "differential_geometry" >}}) and [Dual Curvature Theory]({{< relref "dual_curvature_theory" >}}) instead of [Motion Interpolation]({{< relref "motion_interpolation" >}}). The author claims that it makes the expressions simpler and intuitive.


## Info {#info}

This paper presents the method of trajectory planning by the robot end-effector which accounts for more accurate and smooth differential geometry of the ruled surface generated by tool line fixed with end-effector based on the methods of curvature theory of ruled surface and the dual curvature theory, and focuses on the underlying relation to unite them for enhancing the efficiency for trajectory planning. Robot motion can be represented as motion properties of the ruled surface generated by trajectory of the Tool Center Point (TCP). The linear and angular properties of the six degree-of-freedom motion of end-effector are computed using the explicit formulas and functions from curvature theory and dual curvature theory. This paper explains the complete dualization of ruled surface and shows that the linear and angular motion applied using the method of dual curvature theory is more accurate and less complex.


## Notes {#notes}


### Resumo {#resumo}

The work describes the trajectory of the robot's end effector by using [Differential Geometry]({{< relref "differential_geometry" >}}) and [Dual Curvature Theory]({{< relref "dual_curvature_theory" >}}) instead of [Motion Interpolation]({{< relref "motion_interpolation" >}}). The author claims that it makes the expressions simpler and intuitive.


### Nota 1 {#nota-1}

Exemplifies the [Path Planning]({{< relref "path_planning" >}}) as being constructed by some data points and [Motion Interpolation]({{< relref "motion_interpolation" >}}).


### Nota 2 {#nota-2}

Defines [Ruled Surface]({{< relref "ruled_surface" >}}) as a trajectory made when a line moves in space.
